students = {1: 'Аузін Роман Олександрович',
            2: 'Бабченко Роман Олексійович',
            3: 'Бессчастний Сергій Володимирович',
            4: 'Грецький Ігор Олександрович',
            5: 'Депешко Владислав Олександрович',
            6: 'Каланча Інга Георгіївна',
            7: 'Мармиш Костянтин Михайлович',
            8: 'Мовчан Ігор Ігорович',
            9: 'Поддубіцький Дмитро Анатолійович',
            10: 'Свірін Сергій Вадимович',
            11: 'Стегніщева Олександра Миколаївна',
            12: 'Столітній Антон Володимирович',
            13: 'Холодний Юрій Андрійович',
            14: 'Цагурія Лука Бадрієвич',
            15: 'Шубський Данил Євгенович'}

def decor_sort(func):
        def wrapper(dict):
            my_set = func(dict)
            sort_list = list(sorted(my_set, key=lambda value: value[1]))
            return sort_list
        return wrapper

@decor_sort
def dict_to_set(dict):
    my_set = set()
    for k,v in dict.items():
        my_set.add((v, k))
    return my_set


print(dict_to_set(students))




